Multi-Function-Web/app/Controllers/User.php

SELECT *
FROM `users`
---
    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();

UPDATE `users` SET `name` = 'Karan Chaudhary ', `email` = 'karanchaudhary1101@gmail.com', `mobile` = '7426920047', `updated_at` = '2024-07-16 10:12:34'
WHERE `users`.`id` IN ('8')
---
        // echo '</pre>';
        // die('Data prepared for update');

        if ($model->update($id, $userData)) {

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
            return redirect()->back()->withInput()->with('error', 'Failed to update user');
        }
    } else {
        $data['user'] = $model->find($id);

DELETE FROM `users`
WHERE `id` IN ('8')
---
    public function delete($id)
    {
        $model = new UserModel();
        $model->delete($id);